zitzmannl/STM32-Microcontrollers/Keypad-Interface/Final-Integrated-Game/final_game.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_gpio.h"
#include "seven_segment_display.h"
#include "keypad_func.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

I2S_HandleTypeDef hi2s3;

SPI_HandleTypeDef hspi1;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2S3_Init(void);
static void MX_SPI1_Init(void);
void MX_USB_HOST_Process(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_I2C1_Init();
  MX_I2S3_Init();
  MX_SPI1_Init();
  MX_USB_HOST_Init();
  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */
    MX_USB_HOST_Process();

    /* USER CODE BEGIN 3 */
    char last_key;
    char key = 0;
    int time = 0;
    uint16_t temp = HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_0);


while(key == 0){
	key = Keypad_Read();

}
if(temp == 0){
	Display(time);
	 HAL_Delay(1000);
	while(time == key){
		uint16_t bttn = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0);
	if(bttn == 1) {
  		 HAL_Delay(500);
  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
	  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
	  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
	  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
	  		 HAL_Delay(500);
	  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
	  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
	  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
	  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
	  	}
	else{
		break;
	}
	}
		 HAL_Delay(1000);

		 time = time +1;
		Display(time);
		while(time == key){
			uint16_t bttn = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0);
		if(bttn == 1) {
	  		 HAL_Delay(500);
	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
		  		 HAL_Delay(500);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
		  	}
		else{
			break;
		}
		}
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
		 HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
		HAL_Delay(1000);
}
else{
	time = time + 1;
}
		/*Display(time);
		 HAL_Delay(1000);
		while(time == key){
			uint16_t bttn = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0);
		if(bttn == 1) {
	  		 HAL_Delay(500);
	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
		  		 HAL_Delay(500);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
		  	}
		else{
			break;
		}
		}
   		 HAL_Delay(1000);
   		 //Display(1);
   		 time = time +1;
   		Display(time);
    		while(time == key){
    			uint16_t bttn = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0);
    		if(bttn == 1) {
    	  		 HAL_Delay(500);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
    		  		 HAL_Delay(500);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    		  	}
    		else{
    			break;
    		}
    		}
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
   		 HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
   		HAL_Delay(1000);*/
   		//Display(2);
   		 time = time +1;
   		Display(time);
    		while(time == key){
    			uint16_t bttn = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0);
    		if(bttn == 1) {
    	  		 HAL_Delay(500);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
    		  		 HAL_Delay(500);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    		  	}
    		else{
    			break;
    		}
    		}
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
   		 HAL_Delay(1000);
   		 //Display(3);
   		 time = time +1;
   		Display(time);
    		while(time == key){
    			uint16_t bttn = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0);
    		if(bttn == 1) {
    	  		 HAL_Delay(500);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
    		  		 HAL_Delay(500);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    		  	}
    		else{
    			break;
    		}
    		}
   			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
   			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
   		HAL_Delay(1000);
   		//Display(4);
   		 time = time +1;
   		Display(time);
    		while(time == key){
    			uint16_t bttn = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0);
    		if(bttn == 1) {
    	  		 HAL_Delay(500);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
    		  		 HAL_Delay(500);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    		  	}
    		else{
    			break;
    		}
    		}
   		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
   		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
   		HAL_Delay(1000);
   		//Display(5);
   		 time = time +1;
   		Display(time);
   		 HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
   		while(time == key){
   			uint16_t bttn = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0);

