zitzmannl/STM32-Microcontrollers/Keypad-Interface/Final-Integrated-Game/final_game.c
   		if(bttn == 1) {
   	  		 HAL_Delay(500);
   	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
   	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
   	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
   	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
   	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
   		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
   		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
   		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
   		  		 HAL_Delay(500);
   		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
   		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
   		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
   		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
   		  	}
   		else{

   			break;
   		}
   		}
		 HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
		 HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
		 HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
		 HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
   		HAL_Delay(1000);
   		//Display(6);
   		 time = time +1;
   		Display(time);
    		while(time == key){
    			uint16_t bttn = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0);
    		if(bttn == 1) {
    	  		 HAL_Delay(500);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
    		  		 HAL_Delay(500);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    		  	}
    		else{
    			break;
    		}
    		}
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
   		HAL_Delay(1000);
   		//Display(7);
   		 time = time +1;
   		Display(time);
    		while(time == key){
    			uint16_t bttn = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0);
    		if(bttn == 1) {
    	  		 HAL_Delay(500);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
    		  		 HAL_Delay(500);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    		  	}
    		else{
    			break;
    		}
    		}
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
   		HAL_Delay(1000);
   		//Display(8);
   		 time = time +1;
   		Display(time);
    		while(time == key){
    			uint16_t bttn = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0);
    		if(bttn == 1) {
    	  		 HAL_Delay(500);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
    		  		 HAL_Delay(500);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    		  	}
    		else{
    			break;
    		}
    		}
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
   		HAL_Delay(1000);
   		//Display(9);
   		 time = time +1;
   		Display(time);
    		while(time == key){
    			uint16_t bttn = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0);
    		if(bttn == 1) {
    	  		 HAL_Delay(500);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    	  		  	  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, SET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
    		  		 HAL_Delay(500);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
    		  		  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, RESET);
    		  	}
    		else{
    			break;
    		}
    		}
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, RESET);
   		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, SET);
   		time = 0;
   		last_key = key;
   		HAL_Delay(50);
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

